sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
// Read gravity vector
static void read_grv_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_GRV_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}


static void imu_init_values(void)
{
	// Reset all IMU output values
	bno055_config.init_ok = true;
	bno055_config.dev_en = false;
	bno055_config.comp_mask = 0x0F;
	for(uint8_t i = 0; i < 3; i++) {
		bno055_config.gyro_bias[i] = 0;
		bno055_config.accel_bias[i] = 0;
		bno055_config.mag_bias[i] = 0;
		bno055_output.accel[i].val = 0;
		bno055_output.gyro[i].val = 0;
		bno055_output.mag[i].val = 0;
		bno055_output.lia[i].val = 0;
		bno055_output.grv[i].val = 0;
	}
	for(uint8_t i = 0; i < 4; i++) {
		bno055_output.quat[i].val = 0;
		bno055_output.euler[i].val = 0;
	}
	bno055_output.temp.val = 0;
	bno055_output.ts_us = 0;
	
	// Set all IMU configuration values
	bno055_config.g_pwr_mode = NormalG;	// Gyro power mode
	bno055_config.g_scale = GFS_250DPS;	// Gyro full scale
	bno055_config.g_bw = GBW_523Hz;		// Gyro bandwidth
	bno055_config.a_pwr_mode = NormalA;	// Accel power mode
	bno055_config.a_scale = AFS_2G;		// Accel full scale
	bno055_config.a_bw = ABW_1000Hz;	// Accel bandwidth, accel sample rate divided by ABW_divx
	bno055_config.m_pwr_mode = Normal;	// Select magnetometer power mode
	bno055_config.m_op_mode = Regular;	// Select magnetometer perfomance mode
	bno055_config.m_odr = MODR_30Hz;	// Select magnetometer ODR when in BNO055 bypass mode
	bno055_config.pwr_mode = Normalpwr;	// Select BNO055 power mode
	bno055_config.opr_mode = NDOF;		// specify operation mode for sensors
	bno055_config.dev_calib_done = false;
}

static void imu_init_device(void)
{
	// Reset device & check which component is present
	NRF_LOG_DEBUG("Device reset!\n\r");
	bno055_reset();
	NRF_LOG_DEBUG("Read WHO AM I registers\n\r");
	bno055_config.comp_mask = bno055_check();
	
	if(bno055_config.comp_mask == 0) {
		NRF_LOG_DEBUG("BNO055 working well\n\r");
		bno055_config.init_ok = true;
		bno055_config.dev_en = true;
	}
	else {
		if(bno055_config.comp_mask == 0x0F) {
			NRF_LOG_DEBUG("BNO055 not working\n\r");
		}
		else if(bno055_config.comp_mask == 0x07) {
			NRF_LOG_DEBUG("BNO055 accelerometer not working.\n\r");
		}
		else if(bno055_config.comp_mask == 0x03) {
			NRF_LOG_DEBUG("BNO055 gyroscope not working.\n\r");
		}
		else if(bno055_config.comp_mask == 0x01){
			NRF_LOG_DEBUG("BNO055 magnetometer not working.\n\r");
		}
		bno055_config.init_ok = true;
		bno055_config.dev_en = true;
//		bno055_test();
	}

	// Read firmware infos & proceed to self-test
	bno055_test();
	
//	// Write configuration values
//	// Select BNO055 config mode
//	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
//	nrf_delay_ms(25);
//	// Select page 1 to configure sensors
//	writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x01);
//	// Configure ACC
//	writeByte(BNO055_ADDRESS, BNO055_ACC_CONFIG, bno055_config.a_pwr_mode << 5 | bno055_config.a_bw << 2 | bno055_config.a_scale);
//	// Configure GYR
//	writeByte(BNO055_ADDRESS, BNO055_GYRO_CONFIG_0, bno055_config.g_bw << 3 | bno055_config.g_scale);
//	writeByte(BNO055_ADDRESS, BNO055_GYRO_CONFIG_1, bno055_config.g_pwr_mode);
//	// Configure MAG
//	writeByte(BNO055_ADDRESS, BNO055_MAG_CONFIG, bno055_config.m_pwr_mode << 5 | bno055_config.m_op_mode << 3 | bno055_config.m_odr);

//	// Select page 0 to read sensors & configure orientation
//	writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x00);
//	
//	// Set BNO055 axis configuration P3 (0x21 / 0x02)
//	writeByte(BNO055_ADDRESS, BNO055_AXIS_MAP_CONFIG, 0x21);
//	writeByte(BNO055_ADDRESS, BNO055_AXIS_MAP_SIGN, 0x02);

//	// Select BNO055 gyro temperature source 
//	writeByte(BNO055_ADDRESS, BNO055_TEMP_SOURCE, 0x01 );

//	// Select BNO055 sensor units (temperature in degrees C, rate in dps, accel in mg)
//	writeByte(BNO055_ADDRESS, BNO055_UNIT_SEL, 0x01 );
//	
//	// Select BNO055 system power mode
//	writeByte(BNO055_ADDRESS, BNO055_PWR_MODE, bno055_config.pwr_mode);

//	// Select BNO055 NDOF operation mode
//	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, NDOF);
//	nrf_delay_ms(25);

}


static void imu_calibrate(void)
{
	NRF_LOG_DEBUG("Calibrating BNO055!\n\r");
	
	bno055_calibrate_accel_gyro(bno055_config.accel_bias, bno055_config.gyro_bias);
	NRF_LOG_INFO("Average accelerometer biases (mg). X: " NRF_LOG_FLOAT_MARKER 
				", Y: " NRF_LOG_FLOAT_MARKER 
				", Z: " NRF_LOG_FLOAT_MARKER "\n\r", 
				NRF_LOG_FLOAT(bno055_config.accel_bias[0]), 
				NRF_LOG_FLOAT(bno055_config.accel_bias[1]), 
				NRF_LOG_FLOAT(bno055_config.accel_bias[2]));
	NRF_LOG_INFO("Average gyroscope biases (dps). X: " NRF_LOG_FLOAT_MARKER 
				", Y: " NRF_LOG_FLOAT_MARKER 
				", Z: " NRF_LOG_FLOAT_MARKER "\n\r", 
				NRF_LOG_FLOAT(bno055_config.gyro_bias[0]), 
				NRF_LOG_FLOAT(bno055_config.gyro_bias[1]), 
				NRF_LOG_FLOAT(bno055_config.gyro_bias[2]));

	nrf_delay_ms(1000);
	
	bno055_calibrate_mag(bno055_config.mag_bias);
	NRF_LOG_INFO("Average magnometer biases (mG): X: " NRF_LOG_FLOAT_MARKER
				", Y: " NRF_LOG_FLOAT_MARKER
				", Z: " NRF_LOG_FLOAT_MARKER "\n\r",
				NRF_LOG_FLOAT(bno055_config.mag_bias[0]),
				NRF_LOG_FLOAT(bno055_config.mag_bias[1]),
				NRF_LOG_FLOAT(bno055_config.mag_bias[2]));
}


void imu_check_cal(void)
{
//	// Select BNO055 config mode
//	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE);
//	nrf_delay_ms(25);
	// Read calibration state
	bno055_config.cal_state = readByte(BNO055_ADDRESS, BNO055_CALIB_STAT);
//	// Select BNO055 system operation mode
//	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, bno055_config.opr_mode);
//	nrf_delay_ms(25);
}



void imu_poll_data(uint8_t data_msk)
{
	float ax, ay, az, gx, gy, gz, mx, my, mz;

	if(data_msk & SMS_IMU_DATAMSK_ACCEL) {
		int16_t data[3];
		read_accel_data(data);  // Read the x/y/z adc values
		// Now we'll calculate the accleration value into actual mg's
		ax = (float)data[0]; // - accelBias[0];  // subtract off calculated accel bias
		ay = (float)data[1]; // - accelBias[1];
		az = (float)data[2]; // - accelBias[2];
		// Fill the sensor output table for later sending
		bno055_output.accel[0].val = ax;
		bno055_output.accel[1].val = ay;
		bno055_output.accel[2].val = az;
		NRF_LOG_DEBUG("Raw acceleration (10^6): %x, %x, %x\n\r",
				(int32_t)(ax*1000000.),
				(int32_t)(ay*1000000.),
				(int32_t)(az*1000000.));
	}
	
	if(data_msk & SMS_IMU_DATAMSK_GYRO) {
		int16_t data[3];
		read_gyro_data(data);  // Read the x/y/z adc values
		// Calculate the gyro value into actual degrees per second
		gx = (float)data[0]/16.; // - gyroBias[0];  // subtract off calculated gyro bias
		gy = (float)data[1]/16.; // - gyroBias[1];  
		gz = (float)data[2]/16.; // - gyroBias[2];  
		// Fill the sensor output table for later sending
		bno055_output.gyro[0].val = gx;
		bno055_output.gyro[1].val = gy;
		bno055_output.gyro[2].val = gz;
		NRF_LOG_DEBUG("Raw gyroscope (10^6)   : %ld, %ld, %ld\n\r",
				(int32_t)(gx*1000000.),
				(int32_t)(gy*1000000.),
				(int32_t)(gz*1000000.));
	}

	if(data_msk & SMS_IMU_DATAMSK_MAG) {
		int16_t data[3];
		read_mag_data(data);  // Read the x/y/z adc values   
		// Calculate the magnetometer values in milliGauss
		mx = (float)data[0]/1.6; // - magBias[0];  // get actual magnetometer value in mGauss 
		my = (float)data[1]/1.6; // - magBias[1];  
		mz = (float)data[2]/1.6; // - magBias[2];   
		// Fill the sensor output table for later sending
		bno055_output.mag[0].val = mx;
		bno055_output.mag[1].val = my;
		bno055_output.mag[2].val = mz;
		NRF_LOG_DEBUG("Raw magnetometer (10^6): %ld, %ld, %ld\n\r",
				(int32_t)(mx*1000000.),
				(int32_t)(my*1000000.),
				(int32_t)(mz*1000000.));
	}
    
	if(data_msk & SMS_IMU_DATAMSK_QUAT) {
		float q[4];
		int16_t data[4];
		read_quat_data(data);  // Read the x/y/z adc values   
		// Calculate the quaternion values  
		q[0] = (float)(data[0])/16384.;    
		q[1] = (float)(data[1])/16384.;  
		q[2] = (float)(data[2])/16384.;   
		q[3] = (float)(data[3])/16384.;   
		// Fill the sensor output table for later sending
		bno055_output.quat[0].val = q[0];
		bno055_output.quat[1].val = q[1];
		bno055_output.quat[2].val = q[2];
		bno055_output.quat[3].val = q[3];
		NRF_LOG_DEBUG("Raw quaternions (10^6) : %ld, %ld, %ld, %ld\n\r",
				(int32_t)(q[0]*1000000.),
				(int32_t)(q[1]*1000000.),
				(int32_t)(q[2]*1000000.),
				(int32_t)(q[3]*1000000.));
	}
	
