sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
	if(data_msk & SMS_IMU_DATAMSK_EULER) {
		float yaw, roll, pitch;
		int16_t data[3];
		read_euler_data(data);  // Read the x/y/z adc values   
		// Calculate the Euler angles values in degrees
		yaw = (float)data[0]/16.;  
		roll = (float)data[1]/16.;  
		pitch = (float)data[2]/16.;   
		// Fill the sensor output table for later sending
		bno055_output.euler[0].val = yaw;
		bno055_output.euler[1].val = pitch;
		bno055_output.euler[2].val = roll;
		for(int i = 0; i < 4; i++) {
			bno055_output.euler[3].b[i] = 0xff;
		}
		NRF_LOG_DEBUG("Raw euler angles (10^6): %ld, %ld, %ld\n\r",
				(int32_t)(yaw*1000000.),
				(int32_t)(roll*1000000.),
				(int32_t)(pitch*1000000.));
	}
	
	if(data_msk & SMS_IMU_DATAMSK_LIA) {
		float lia[3];
		int16_t data[3];
		read_lia_data(data);  // Read the x/y/z adc values   
		// Calculate the linear acceleration (sans gravity) values in mg
		lia[0] = (float)data[0];  
		lia[1] = (float)data[1];  
		lia[2] = (float)data[2];   
		// Fill the sensor output table for later sending
		bno055_output.lia[0].val = lia[0];
		bno055_output.lia[1].val = lia[1];
		bno055_output.lia[2].val = lia[2];
		NRF_LOG_DEBUG("Raw LIA (10^6)         : %ld, %ld, %ld\n\r",
				(int32_t)(lia[0]*1000000.),
				(int32_t)(lia[1]*1000000.),
				(int32_t)(lia[2]*1000000.));
	}
	
	if(data_msk & SMS_IMU_DATAMSK_GRV) {
		float grv[3];
		int16_t data[3];
		read_grv_data(data);  // Read the x/y/z adc values   
		// Calculate the linear acceleration (sans gravity) values in mg
		grv[0] = (float)data[0];  
		grv[1] = (float)data[1];  
		grv[2] = (float)data[2];   
		// Fill the sensor output table for later sending
		bno055_output.grv[0].val = grv[0];
		bno055_output.grv[1].val = grv[1];
		bno055_output.grv[2].val = grv[2];
		NRF_LOG_DEBUG("Raw gravity (10^6)     : %ld, %ld, %ld\n\r",
				(int32_t)(grv[0]*1000000.),
				(int32_t)(grv[1]*1000000.),
				(int32_t)(grv[2]*1000000.));
	}
	
	//Chose (once) between unprecise but low-power ms app timer
	// and precise current-demanding us drv timer 
//	static uint32_t last_time_ms = 0;
//	uint32_t now_ms = app_timer_cnt_get();
//	uint32_t delta_ms = (now_ms - last_time_ms)/33;
//	last_time_ms = now_ms;
//	static uint32_t last_time_us = 0;
//	uint32_t delta_us;
//	uint32_t now_us = nrf_drv_timer_capture(&TIMER_DELTA_US, NRF_TIMER_CC_CHANNEL0);
//	if(now_us > last_time_us) {
//		delta_us = now_us - last_time_us;
//	}
//	else {
//		delta_us = 0xFFFFFFFF - last_time_us + now_us;
//	}
//	last_time_us = now_us;
//	// Fill the sensor output table for later sending
//	bno055_output.ts_us = now_us;
//	NRF_LOG_INFO("Timestamp/Delta (us)   : %ld/%ld\n\r", bno055_output.ts_us, delta_us);
	
	bno055_interrupt.rts = true;
}


void imu_enable(void)
{
	// Switching on IMU supply
	nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_ON);
	// Initialize all IMU values
	imu_init_values();
	// Initialize IMU hardware
	NRF_LOG_DEBUG("Init device\n\r");
	imu_init_device();
	
	NRF_LOG_INFO("BNO055 enabled? %d\r\n\n", bno055_config.dev_en);
	if(bno055_config.dev_en) {
		// Calibrate
		imu_calibrate();
		imu_check_cal();
		NRF_LOG_INFO("System calibration: %d\n\r",
					((0xC0 & bno055_config.cal_state) >> 6));
		NRF_LOG_INFO("Gyro   calibration: %d\n\r",
					((0x30 & bno055_config.cal_state) >> 4));
		NRF_LOG_INFO("Accel  calibration: %d\n\r",
					((0x0C & bno055_config.cal_state) >> 2));
		NRF_LOG_INFO("Mag    calibration: %d\n\r",
					((0x03 & bno055_config.cal_state) >> 0));
	}
}
